Revit 2027 API
ElectricalSystem.Ways Property
 The circuit ways used in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Ways { get; }
Public ReadOnly Property Ways As Integer
	Get
public:
property int Ways {
	int get ();
}
member Ways : int with get
Property Value
Int32
Remarks
 This property is used to retrieve the ways of the Electrical System on a panel.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace